In [1]:
import numpy as np
import pandas as pd

In [4]:
mylist=['a','b','c']
values=[10,20,30]
d={'a':10,'b':20,'c':30}
#you can assign your desired indexing,in addition, you can access values either through conventional method([0,1,2]) or through your newly designed one
pd.Series(data=values,index=mylist)

a    10
b    20
c    30
dtype: int64

In [5]:
#PANDAS DATAFRAMES
from numpy.random import randint
np.random.seed(42)
columns=['x','y','z']
index=['a','b','c']
data=randint(-100,100,(3,3))
df=pd.DataFrame(data,index,columns)
df

    x   y   z
a   2  79  -8
b -86   6 -29
c  88 -80   2

In [6]:
df['new']=df['x']/2
df

    x   y   z   new
a   2  79  -8   1.0
b -86   6 -29 -43.0
c  88 -80   2  44.0

In [8]:
df=df.drop(labels='new',axis=1)
df

    x   y   z
a   2  79  -8
b -86   6 -29
c  88 -80   2

In [9]:
#get columns
df[['x','y']]

    x   y
a   2  79
b -86   6
c  88 -80

In [10]:
#get rows
df.loc[['a','b']]

    x   y   z
a   2  79  -8
b -86   6 -29

In [11]:
#get rows by integer
df.iloc[-1]

x    88
y   -80
z     2
Name: c, dtype: int32

In [12]:
df.iloc[0:2]

    x   y   z
a   2  79  -8
b -86   6 -29

In [13]:
df.loc[['a','b'],'x'] # it will give only one column value associated with the mentioned rows

a     2
b   -86
Name: x, dtype: int32

In [14]:
#CONDITIONS
df > 0

       x      y      z
a   True   True  False
b  False   True  False
c   True  False   True

In [15]:
df[df>0]

      x     y    z
a   2.0  79.0  NaN
b   NaN   6.0  NaN
c  88.0   NaN  2.0

In [16]:
df[df['x']>0]

    x   y  z
a   2  79 -8
c  88 -80  2

In [19]:
#multiple conditions
df[(df['x']>0) & (df['y']>0)]

   x   y  z
a  2  79 -8

In [20]:
df

    x   y   z
a   2  79  -8
b -86   6 -29
c  88 -80   2

In [23]:
#changing name of indexes
df['states']=['rwp','isl','lhr']
df.set_index('states')

         x   y   z
states
rwp      2  79  -8
isl    -86   6 -29
lhr     88 -80   2

In [24]:
#important
df.describe()

               x          y          z
count   3.000000   3.000000   3.000000
mean    1.333333   1.666667 -11.666667
std    87.001916  79.588525  15.821926
min   -86.000000 -80.000000 -29.000000
25%   -42.000000 -37.000000 -18.500000
50%     2.000000   6.000000  -8.000000
75%    45.000000  42.500000  -3.000000
max    88.000000  79.000000   2.000000

In [27]:
df.dtypes

x          int32
y          int32
z          int32
states    object
dtype: object

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, a to c
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   x       3 non-null      int32
 1   y       3 non-null      int32
 2   z       3 non-null      int32
 3   states  3 non-null      object
dtypes: int32(3), object(1)
memory usage: 164.0+ bytes

In [29]:
df.head() #return back top 5 rows

    x   y   z states
a   2  79  -8    rwp
b -86   6 -29    isl
c  88 -80   2    lhr

In [ ]:
x=df['x'].mean()
df.dropna()
df.fillna(value=x)